{
	"data":[
	{
		"id":1,
		"q_label":"Motivation",
		"quest":"What motivates you to work? What are you passionate about?",
		"visemes":[[7, 1, 19, 21, 8, 19, 1, 18, 4, 19, 15, 6, 7, 19, 7, 7, 5, 20, 0], [7, 1, 19, 2, 13, 6, 7, 21, 1, 16, 1, 19, 1, 19, 1, 21, 9, 19, 0], [0]],
		"text":"I am always curious about new technologies and excited about applying them to create new products. Working with full dedication towards a goal, making progress every day, and the desire to meet the target and the deadline always keep me motivated."
	},
	{
		"id":2,
		"q_label":"Demotivation",
		"quest":"What de-motivates or de-moralizes you? What bores you? Or What discourages you from giving your 100%?",
		"visemes":[[7, 1, 19, 19, 6, 21, 8, 19, 1, 18, 4, 19, 15, 3, 13, 19, 6, 6, 7, 0], [7, 1, 19, 21, 3, 13, 15, 6, 7, 0], [3, 13, 7, 1, 19, 19, 6, 15, 20, 5, 6, 16, 6, 15, 6, 7, 18, 13, 1, 21, 20, 6, 18, 6, 20, 6, 3, 13, 0], [0]],
		"text":"I have a highly positive outlook on life and generally, do not get demotivated. I find there are many things to look forward to in my life and work. If one wants to see positive things, one can always find them. If for some reason, the working environment is highly negative, I will surely find the strength to help improve the environment itself. I will not give up."
	},
	{
		"id":3,
		"q_label":"Handling failures",
		"quest":"How do you handle failures? Or What do you do when you do not get success?",
		"visemes":[[12, 9, 19, 7, 6, 7, 12, 1, 19, 19, 1, 14, 18, 4, 14, 6, 5, 15, 0], [3, 13, 7, 1, 19, 19, 7, 6, 7, 19, 7, 7, 4, 19, 6, 7, 19, 7, 19, 2, 19, 20, 4, 19, 15, 1, 20, 15, 4, 15, 0], [0]],
		"text":"I believe failures are part of any useful or innovative work. I have read the biographies of many successful people and they all had many failures that taught them valuable lessons. If I have any failure, I take a step back, think about it from a broader perspective, investigate what caused it, and rectify it immediately. I also think about how to prevent similar failures, make notes, and implement it in the future."
	},
	{
		"id":4,
		"q_label":"Taking responsibility",
		"quest":"Can you talk about a time when you failed? And then what did you do?",
		"visemes":[[20, 1, 19, 6, 7, 19, 3, 20, 1, 21, 9, 19, 1, 19, 11, 21, 7, 4, 19, 6, 7, 18, 4, 14, 19, 0], [1, 19, 19, 17, 4, 19, 7, 1, 19, 19, 6, 19, 6, 7, 19, 7, 0], [0]],
		"text":"During my training, I had made a mistake somewhere and the results were not as we expected. I spent much time investigating it and finally, I found that the data I was given was completely outdated and even wrong. As we all know, Garbage in garbage out. So, I requested the most recent data, and everything worked fine. I learned that I should always verify the correctness of the data. I wrote it in my diary and made it a habit. "
	},
	{
		"id":5,
		"q_label":"Role models",
		"quest":"Who are your role models?, Whose biographies have you read? or What kind of people inspire you?",
		"visemes":[[12, 7, 2, 13, 6, 3, 13, 13, 8, 14, 21, 2, 19, 1, 14, 15, 0], [0, 12, 7, 15, 21, 11, 2, 20, 13, 1, 18, 6, 15, 12, 1, 18, 6, 7, 13, 4, 19, 0], [3, 13, 7, 1, 19, 20, 11, 19, 19, 1, 18, 21, 6, 21, 1, 14, 6, 19, 15, 21, 11, 13, 6, 7, 0], [0]],
		"text":"I have several role models. I would say, one of my Professors. Besides that, I have been inspired by the lives of Nicola Tesla, Grace Hopper, Mary Kenneth Keller, Bill Gates, Steve Wozniak, Narayana Murthy, Elon Musk and many others. "
	},
	{
		"id":6,
		"q_label":"Verify the answer",
		"quest":"What did you learn from the life of one of your role models?",
		"visemes":[[7, 1, 19, 19, 6, 19, 6, 7, 14, 5, 19, 18, 13, 1, 21, 17, 1, 14, 11, 18, 1, 18, 7, 1, 19, 1, 18, 6, 3, 13, 13, 8, 14, 21, 2, 19, 1, 14, 15, 0], [0]],
		"text":"The most important thing I have learned from the life of Bill Gates is that we have to foresee technological revolutions or innovations that will have a large-scale impact on society. Then get into it and be a part of it and contribute to it instead of being just a passive observer or a user."
	},
	{
		"id":7,
		"q_label":"self-motivation",
		"quest":"Was there a time when your plan went wrong? and what did you do?  Or Give me an example of something you have done in a planned and organized manner but you had to change your plan.",
		"visemes":[[7, 2, 15, 17, 4, 13, 1, 19, 11, 21, 7, 4, 19, 6, 3, 13, 21, 14, 1, 19, 7, 4, 19, 19, 13, 3, 20, 0], [1, 19, 19, 7, 1, 19, 19, 6, 19, 6, 7, 19, 7, 0], [3, 13, 20, 6, 18, 21, 6, 1, 19, 6, 20, 15, 1, 21, 21, 1, 14, 1, 18, 15, 1, 21, 17, 6, 20, 6, 7, 12, 1, 18, 19, 1, 19, 6, 19, 1, 21, 14, 1, 19, 19, 1, 19, 19, 3, 13, 20, 1, 19, 11, 15, 19, 21, 1, 19, 5, 21, 1, 19, 6, 7, 12, 1, 19, 19, 7, 16, 4, 19, 16, 6, 3, 13, 21, 14, 1, 19, 0], [0]],
		"text":"When I was doing my undergrad project, I had planned it very well, and I was making good progress. Then a paper was published by a team from the UK which essentially had what I was planning to do. So, instead of changing my project for which we did not have enough time left, I looked at what they had done. I found a more efficient way of doing it and worked long hours for five weeks to implement that in my project. Thus, I could do something new as well as finish my project on time."
	},
	{
		"id":8,
		"q_label":"Dedication 1",
		"quest":"Suppose, a customer is unhappy and your manager wants you to handle the problem in two days, and you have plans for holidays, what will you do?",
		"visemes":[[15, 1, 21, 8, 15, 0, 1, 20, 1, 15, 19, 1, 21, 5, 6, 15, 1, 19, 12, 1, 21, 6, 1, 19, 19, 6, 3, 13, 21, 1, 19, 1, 16, 5, 7, 2, 19, 19, 15, 6, 7, 19, 7, 12, 1, 19, 19, 1, 14, 17, 1, 21, 13, 2, 21, 14, 1, 21, 6, 19, 19, 7, 19, 4, 15, 0, 1, 19, 19, 6, 7, 12, 1, 18, 21, 14, 1, 19, 15, 18, 3, 13, 12, 2, 14, 1, 19, 4, 15, 0, 7, 1, 19, 7, 6, 14, 6, 7, 19, 7, 0], [0]],
		"text":"The customer and the work certainly come first. I will discuss with the manager the details to see if it can be done in two days. If yes, I will do it even if I have to postpone my holidays. If it seems impossible to do in two days, I will ask the manager to give me the support of another team member or negotiate the time with the customer. In any case, I will get it done and make the customer satisfied."
	},
	{
		"id":9,
		"q_label":"Quick learner 1",
		"quest":"Suppose, some part of your work is very difficult, and you do not know how to do it. What will you do?",
		"visemes":[[15, 1, 21, 8, 15, 0, 15, 1, 21, 21, 2, 13, 19, 1, 18, 6, 3, 13, 7, 5, 20, 6, 15, 18, 4, 13, 6, 19, 6, 18, 1, 20, 1, 14, 19, 0, 1, 19, 19, 6, 7, 19, 7, 19, 2, 19, 19, 8, 12, 9, 19, 7, 19, 7, 6, 19, 0], [7, 1, 19, 7, 6, 14, 6, 7, 19, 7, 0], [0]],
		"text":"I will immediately get deeper into the problem to see what I need to learn. If I can learn something quickly from various sources and feel that I can do it in time, I will do it. But if I think, a colleague, the team leader or an internal expert can help me, I will seek the minimum help early enough so that the work is done in time."
	},
	{
		"id":10,
		"q_label":"Confidence 1",
		"quest":"So, you are not confident that you can do everything alone.",
		"visemes":[[15, 8, 0, 6, 7, 2, 13, 19, 2, 19, 20, 2, 19, 18, 1, 19, 1, 19, 19, 17, 1, 19, 6, 7, 20, 1, 19, 19, 7, 4, 18, 13, 6, 17, 6, 20, 1, 14, 8, 19, 0], [0]],
		"text":"I like new challenges, that gives me opportunities to learn and apply. My fundamentals are strong and I am confident that I can learn anything and solve any problem. However, realistically, sometimes it is better and quicker to get help from someone who is more knowledgeable and experienced. I can imagine, in some rare cases, we may even need the expertise of another team."
	},
	{
		"id":11,
		"q_label":"New Challenges 1",
		"quest":"Can you tell us about a time when you were given a task that was new to you and how you handled that?",
		"visemes":[[20, 1, 19, 6, 7, 19, 4, 14, 1, 15, 1, 21, 9, 19, 1, 19, 11, 21, 7, 4, 19, 6, 7, 7, 5, 20, 6, 18, 1, 19, 1, 19, 1, 15, 20, 17, 1, 19, 7, 2, 15, 19, 7, 19, 7, 6, 7, 1, 19, 19, 12, 9, 6, 7, 12, 1, 19, 19, 1, 14, 19, 17, 1, 19, 0], [0]],
		"text":"During my training at TATA (name of the organization), I was assigned to a team that was developing a system for recording and analyzing data related to heavy-vehicle drivers' driving habits. It was completely new to me. Fortunately, one experienced engineer explained the essentials to me for 2 hours and I understood the project fairly well, well enough to get started. I like learning about new domains and exploring how my field and knowledge can help in other domains. In fact, I like difficult inter-disciplinary work."
	},
	{
		"id":12,
		"q_label":"Unexpected questions",
		"quest":"Are you applying for any other jobs?",
		"visemes":[[2, 13, 6, 7, 1, 21, 14, 11, 6, 20, 18, 3, 13, 4, 19, 6, 1, 17, 5, 16, 2, 21, 15, 0], [0]],
		"text":"I have applied to a few other jobs that seem to match my qualifications and interest. "
	},
	{
		"id":13,
		"q_label":"Why our company",
		"quest":"There are so many companies in this field, why would you choose to work for our company?",
		"visemes":[[17, 4, 13, 2, 13, 15, 8, 21, 4, 19, 6, 20, 1, 21, 21, 1, 19, 6, 15, 6, 19, 17, 6, 15, 18, 6, 14, 19, 0, 7, 11, 7, 4, 19, 6, 7, 16, 7, 15, 19, 7, 7, 5, 20, 18, 3, 13, 9, 5, 20, 1, 21, 21, 1, 19, 6, 0], [0]],
		"text":"This particular position in your company seems to match very well. It seems to require software design, programming, and interacting with various departments such as software testing. So it would give me the opportunity to build a broad-based knowledge and would be ideal for my interests."
	},
	{
		"id":14,
		"q_label":"Unexpected questions 2",
		"quest":"What can you do for our company?",
		"visemes":[[7, 1, 19, 20, 1, 19, 6, 7, 19, 7, 18, 3, 13, 9, 5, 20, 1, 21, 21, 1, 19, 6, 0], [0]],
		"text":"I know that your company is working on solving a problem on … I believe, with my knowledge, experience and out of the box thinking, I can help solve this problem."
	},
	{
		"id":15,
		"q_label":"Company knowledge 2",
		"quest":"What do you know about our company's current focus? ",
		"visemes":[[7, 1, 19, 19, 7, 6, 7, 19, 8, 1, 21, 9, 19, 9, 5, 20, 1, 21, 21, 1, 19, 6, 4, 15, 20, 5, 1, 19, 19, 18, 8, 20, 1, 15, 0], [0]],
		"text":"To the best of my knowledge, your company is focusing on customized solutions, planning to start an R&D division in Asia, and is planning acquisitions to expand its business in IoT, robotics, and factory automation."
	},
	{
		"id":16,
		"q_label":"overtime",
		"quest":"Our new business development department often needs help from the technical experts and you will have to work closely with them. You may even have to travel with them to various potential customers. Are you willing to do that?",
		"visemes":[[9, 5, 19, 7, 21, 6, 15, 19, 1, 15, 19, 6, 18, 4, 14, 1, 21, 21, 1, 19, 19, 19, 6, 21, 2, 13, 19, 21, 1, 19, 19, 3, 18, 1, 19, 19, 6, 19, 15, 12, 4, 14, 21, 18, 13, 1, 21, 17, 1, 19, 4, 20, 19, 6, 20, 1, 14, 4, 20, 15, 21, 5, 19, 15, 1, 19, 19, 6, 7, 7, 6, 14, 12, 1, 18, 19, 7, 7, 5, 20, 20, 14, 8, 15, 14, 6, 7, 6, 17, 17, 4, 21, 0], [6, 7, 21, 4, 6, 18, 6, 19, 12, 1, 18, 19, 7, 19, 13, 1, 18, 1, 14, 7, 6, 17, 17, 4, 21, 19, 7, 18, 4, 13, 6, 1, 15, 21, 1, 19, 4, 19, 16, 1, 14, 20, 1, 15, 19, 1, 21, 5, 15, 0], [2, 13, 6, 7, 7, 6, 14, 6, 20, 19, 7, 19, 7, 17, 1, 19, 0], [0]],
		"text":"Yes. I'd like to learn various aspects of the business at every opportunity and help the company in every way. Meeting customers and supporting the sales team would broaden my experience. If I get this position, I will be a part of this company. So naturally, I would love to help the company whenever and wherever needed. "
	},
	{
		"id":17,
		"q_label":"Ending",
		"quest":"OK. Good. We will need a couple of days to make our final decision and let you know.",
		"visemes":[[8, 20, 4, 0], [20, 4, 19, 0], [7, 6, 7, 6, 14, 19, 6, 19, 1, 20, 1, 21, 1, 14, 1, 18, 19, 4, 15, 19, 7, 21, 4, 20, 9, 5, 18, 11, 19, 1, 14, 19, 6, 15, 6, 16, 1, 19, 1, 19, 19, 14, 4, 19, 6, 7, 19, 8, 0], [0]],
		"text":"Thank you. I look forward to hearing from you."
	}]
}